app/views/messages/_message.html.erb

          <br>
          <span class="label label-info"><%= message.created_at.try(:strftime,"%b %d, %Y") %></span>
---
INSERT INTO "messages" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "dgdfgdfg"], ["created_at", "2015-08-18 13:06:47.931108"], ["updated_at", "2015-08-18 13:06:47.931108"]]