app/views/blogs/index.html.erb

                 <div class="panel-footer">
                        <strong>by <%# blog.user.first_name %></strong>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 10  ORDER BY "users"."id" ASC LIMIT 1