app/views/pins/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 9  ORDER BY "users"."id" ASC LIMIT 1
---
                    <%= pin.descrption %><br />
                    <strong><%= pin.user.first_name %></strong>