app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs"   ORDER BY created_at DESC LIMIT 9 OFFSET 0
---
  def index
    @blogs = Blog.all.order("created_at DESC")
                   .paginate(:page => params[:page], :per_page => 9)

INSERT INTO "blogs" ("created_at", "desc", "tags", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-08-13 08:53:04.120823"], ["desc", "dfsdfsd"], ["tags", "dfsdf"], ["title", "dfsdfsd"], ["updated_at", "2015-08-13 08:53:04.120823"]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    @blog.save

UPDATE "blogs" SET "desc" = ?, "updated_at" = ? WHERE "blogs"."id" = 3  [["desc", "vjvjvjvjk"], ["updated_at", "2015-08-13 20:27:24.982797"]]
---
  def update
    @blog.update(blog_params)