app/controllers/messages_controller.rb

  def index
    @message = current_user.messages.build
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @message = current_user.messages.build(message_params)
    @message.save
---
INSERT INTO "messages" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "hi"], ["created_at", "2015-08-18 12:19:27.525873"], ["updated_at", "2015-08-18 12:19:27.525873"]]