app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 3)
---
SELECT  "pins".* FROM "pins"   ORDER BY created_at DESC LIMIT 9 OFFSET 0

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("created_at", "descrption", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins"  WHERE "pins"."id" = ? LIMIT 1  [["id", 7]]