app/controllers/prettylinks_controller.rb

  def index
    @prettylinks = Prettylink.all
---
SELECT "prettylinks".* FROM "prettylinks"